export default function AboutBlock() {
  return (
    <div className="about-block">
      <p>
        Мы помогаем в изучении корейского языка, собирая полезные материалы по
        грамматике, лексике и произношению, а также информацию о культуре Кореи.
        Однако мы не создаем собственный контент и не берем авторство за
        размещенные ресурсы.
      </p>

      <p>
        На нашем сайте вы найдете упражнения, аудио- и видеоматериалы, а также
        задания для закрепления. Мы не гарантируем, что использование наших
        материалов позволит вам выучить язык, но они могут помочь в практике и
        самостоятельном изучении.
      </p>

      <p>
        Вы можете тренировать разговорные навыки, изучать полезные фразы и
        знакомиться с корейскими традициями. Однако успех зависит от вашей
        регулярной работы и дополнительных методов обучения.
      </p>
    </div>
  );
}
